:PROPERTIES:
:header-args:sqlite: :db db.sqlite3 :colnames yes
:END:
#+title: Sqlite Cmds

* all tables
#+begin_src sqlite
.tables
#+end_src

#+RESULTS:
| auth_group                          django_session                     |
|------------------------------------------------------------------------|
| auth_group_permissions              movies_customuser                  |
| auth_permission                     movies_customuser_groups           |
| django_admin_log                    movies_customuser_user_permissions |
| django_content_type                 movies_movie                       |
| django_migrations                                                      |

* Table info
** movies_customuser
#+begin_src sqlite
PRAGMA table_info(movies_customuser);
#+end_src

#+RESULTS:
| cid | name         | type         | notnull | dflt_value | pk |
|-----+--------------+--------------+---------+------------+----|
|   0 | id           | INTEGER      |       1 |            |  1 |
|   1 | password     | varchar(128) |       1 |            |  0 |
|   2 | last_login   | datetime     |       0 |            |  0 |
|   3 | is_superuser | bool         |       1 |            |  0 |
|   4 | username     | varchar(150) |       1 |            |  0 |
|   5 | first_name   | varchar(150) |       1 |            |  0 |
|   6 | last_name    | varchar(150) |       1 |            |  0 |
|   7 | email        | varchar(254) |       1 |            |  0 |
|   8 | is_staff     | bool         |       1 |            |  0 |
|   9 | is_active    | bool         |       1 |            |  0 |
|  10 | date_joined  | datetime     |       1 |            |  0 |
* Movies
** all movies
#+begin_src sqlite
Select * From movies_movie
#+end_src

#+RESULTS:
| id | title                  | genre    | created_date               | updated_date               | year |
|----+------------------------+----------+----------------------------+----------------------------+------|
|  1 | Fargo                  | comedy   | 2021-01-07 14:07:13.540000 | 2021-01-07 14:07:13.540000 | 1996 |
|  2 | No Country for Old Men | thriller | 2021-01-07 14:06:59.408000 | 2021-01-07 14:06:59.408000 | 2007 |
|  3 | A Serious Man          | comedy   | 2021-01-07 14:06:51.542000 | 2021-01-07 14:06:51.542000 | 2009 |
